hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
static const char *dashSleepStateText()
{
    if (dashSleepActive)
        return "sleep";
    if (!dashAutoSleepEnabled)
        return "off";
    if (dashSleepCandidateSinceMs)
        return "pending";
    return "awake";
}

static long dashSleepSignalAgeSec(unsigned long seenMs)
{
    if (!seenMs)
        return -1;
    return static_cast<long>((millis() - seenMs) / 1000UL);
}

static unsigned long dashSleepSignalAgeMs(unsigned long seenMs)
{
    if (!seenMs)
        return 0xFFFFFFFFUL;
    return millis() - seenMs;
}

static bool dashSleepSignalFresh(unsigned long seenMs, unsigned long maxAgeMs)
{
    return seenMs && dashSleepSignalAgeMs(seenMs) <= maxAgeMs;
}

static int8_t dashSleepSeatSwitchState(uint8_t raw)
{
    // DBC switch values: 1=off/empty, 2=on/occupied, 0=SNA, 3=fault.
    if (raw == 1)
        return kDashSleepSeatEmpty;
    if (raw == 2)
        return kDashSleepSeatOccupied;
    return kDashSleepSeatUnknown;
}

static void dashSleepSetSeatState(int8_t &slot, int8_t state)
{
    if (state == kDashSleepSeatUnknown)
        return;
    slot = state;
    dashSleepSeatSeenMs = millis();
}

static bool dashSleepSeatFresh()
{
    return dashSleepSignalFresh(dashSleepSeatSeenMs, kDashSleepDriveSignalFreshMs);
}

static bool dashSleepSeatKnown()
{
    return dashSleepSeatFresh() &&
           (dashSleepSeatDriver != kDashSleepSeatUnknown ||
            dashSleepSeatPassenger != kDashSleepSeatUnknown ||
            dashSleepSeatRearLeft != kDashSleepSeatUnknown ||
            dashSleepSeatRearCenter != kDashSleepSeatUnknown ||
            dashSleepSeatRearRight != kDashSleepSeatUnknown);
}

static bool dashSleepSeatOccupied()
{
    return dashSleepSeatFresh() &&
           (dashSleepSeatDriver == kDashSleepSeatOccupied ||
            dashSleepSeatPassenger == kDashSleepSeatOccupied ||
            dashSleepSeatRearLeft == kDashSleepSeatOccupied ||
            dashSleepSeatRearCenter == kDashSleepSeatOccupied ||
            dashSleepSeatRearRight == kDashSleepSeatOccupied);
}

static bool dashSleepAllSeatsKnownEmpty()
{
    return dashSleepSeatFresh() &&
           dashSleepSeatDriver == kDashSleepSeatEmpty &&
           dashSleepSeatPassenger == kDashSleepSeatEmpty &&
           dashSleepSeatRearLeft == kDashSleepSeatEmpty &&
           dashSleepSeatRearCenter == kDashSleepSeatEmpty &&
           dashSleepSeatRearRight == kDashSleepSeatEmpty;
}

static void dashSleepClearLockState(const char *source)
{
    dashSleepLockLatched = false;
    dashSleepLockSource = source ? source : "none";
    dashSleepLockLatchedMs = 0;
    dashSleepCandidateSinceMs = 0;
}

static void dashSleepLatchLock(const char *source)
{
    dashSleepLockLatched = true;
    dashSleepLockSource = source ? source : "lock";
    dashSleepLockLatchedMs = millis();
}

#ifdef ESP_PLATFORM
static const char *dashResetReasonName(esp_reset_reason_t reason);
#endif

static const char *dashSleepCurrentResetReason()
{
#ifdef ESP_PLATFORM
    return dashResetReasonName(esp_reset_reason());
#else
    return "unknown";
#endif
}

static void dashSleepSetText(char *dst, size_t dstLen, const char *src)
{
    if (!dst || dstLen == 0)
        return;
    strlcpy(dst, src ? src : "none", dstLen);
}

static void dashSleepLoadText(Preferences &p, const char *key, char *dst, size_t dstLen, const char *fallback)
{
    String v = p.getString(key, fallback ? fallback : "");
    dashSleepSetText(dst, dstLen, v.c_str());
}

static uint32_t dashSleepGetU32(Preferences &p, const char *key, uint32_t fallback)
{
    String v = p.getString(key, "");
    if (v.length() == 0)
        return fallback;
    return static_cast<uint32_t>(strtoul(v.c_str(), nullptr, 10));
}

static void dashSleepPutU32(Preferences &p, const char *key, uint32_t value)
{
    p.putString(key, String(value));
}

static void dashSleepPersistDiag(Preferences &p)
{
    dashSleepPutU32(p, "slp_boots", dashSleepPersistBootCount);
    dashSleepPutU32(p, "slp_total", dashSleepPersistTotalCount);
    dashSleepPutU32(p, "slp_wcan", dashSleepPersistCanWakeCount);
    dashSleepPutU32(p, "slp_wreboot", dashSleepPersistRebootWakeCount);
    dashSleepPutU32(p, "slp_lent", dashSleepLastEnterUptimeSec);
    dashSleepPutU32(p, "slp_lwake", dashSleepLastWakeUptimeSec);
    dashSleepPutU32(p, "slp_ldur", dashSleepLastDurationSec);
    dashSleepPutU32(p, "slp_lrx", dashSleepLastRxCount);
    p.putString("slp_lsrc", dashSleepLastWakeSource);
    p.putString("slp_lwhy", dashSleepLastWakeReason);
    p.putString("slp_rst", dashSleepLastResetReason);
}

static void dashSleepLoadPersistentDiag(Preferences &p)
{
    dashSleepPersistBootCount = dashSleepGetU32(p, "slp_boots", 0) + 1;
    dashSleepPersistTotalCount = dashSleepGetU32(p, "slp_total", 0);
    dashSleepPersistCanWakeCount = dashSleepGetU32(p, "slp_wcan", 0);
    dashSleepPersistRebootWakeCount = dashSleepGetU32(p, "slp_wreboot", 0);
    dashSleepLastEnterUptimeSec = dashSleepGetU32(p, "slp_lent", 0);
    dashSleepLastWakeUptimeSec = dashSleepGetU32(p, "slp_lwake", 0);
    dashSleepLastDurationSec = dashSleepGetU32(p, "slp_ldur", kDashSleepDurationUnknown);
    dashSleepLastRxCount = dashSleepGetU32(p, "slp_lrx", 0);
    dashSleepLoadText(p, "slp_lsrc", dashSleepLastWakeSource, sizeof(dashSleepLastWakeSource), "none");
    dashSleepLoadText(p, "slp_lwhy", dashSleepLastWakeReason, sizeof(dashSleepLastWakeReason), "none");
    dashSleepSetText(dashSleepLastResetReason, sizeof(dashSleepLastResetReason), dashSleepCurrentResetReason());

    dashSleepLastEndedByReboot = p.getBool("slp_active", false);
    if (dashSleepLastEndedByReboot)
    {
        dashSleepPersistRebootWakeCount++;
        dashSleepSetText(dashSleepLastWakeSource, sizeof(dashSleepLastWakeSource), "reboot");
        dashSleepSetText(dashSleepLastWakeReason, sizeof(dashSleepLastWakeReason), dashSleepLastResetReason);
        dashSleepLastWakeUptimeSec = 0;
        dashSleepLastDurationSec = kDashSleepDurationUnknown;
        p.putBool("slp_active", false);
    }

    dashSleepPersistDiag(p);
}

static void dashSleepPersistEnterDiag()
{
    dashSleepPersistTotalCount++;
    dashSleepCurrentRxCount = 0;
    dashSleepLastRxCount = 0;
    dashSleepLastEnterUptimeSec = (millis() - startMs) / 1000UL;
    dashSleepLastWakeUptimeSec = 0;
    dashSleepLastDurationSec = kDashSleepDurationUnknown;
    dashSleepSetText(dashSleepLastWakeSource, sizeof(dashSleepLastWakeSource), "sleeping");
    dashSleepSetText(dashSleepLastWakeReason, sizeof(dashSleepLastWakeReason), "active");

    Preferences p;
    if (!p.begin(PREFS_NS, false))
        return;
    p.putBool("slp_active", true);
    dashSleepPersistDiag(p);
    p.end();
}

static bool dashSleepVcsecStatusLocked(uint8_t status);
static bool dashSleepVcsecStatusUnlocked(uint8_t status);

static bool dashSleepRecentDriveEvidence()
{
    if (dashSleepGearKnown &&
        dashSleepSignalFresh(dashSleepGearSeenMs, kDashSleepDriveSignalFreshMs) &&
        (dashSleepGear == 2 || dashSleepGear == 3 || dashSleepGear == 4))
        return true;
    if (dashSleepDriverKnown &&
        dashSleepSignalFresh(dashSleepDriverSeenMs, kDashSleepDriveSignalFreshMs) &&
        dashSleepDriverPresent)
        return true;
    if (dashSleepSeatOccupied())
        return true;
    if (dashSleepDiPowerKnown &&
        dashSleepSignalFresh(dashSleepDriverSeenMs, kDashSleepDriveSignalFreshMs) &&
        dashSleepDiPowerState == 3)
        return true;
    if (dashSleepEpasKnown &&
        dashSleepSignalFresh(dashSleepEpasSeenMs, kDashSleepDriveSignalFreshMs) &&
        (dashSleepEpasPowerMode == 1 || dashSleepEpasPowerMode == 2))
        return true;
    return false;
}

static bool dashSleepRecentUnlockEvidence()
{
    if (dashSleepUiLockKnown &&
        dashSleepSignalFresh(dashSleepUiLockSeenMs, kDashSleepDriveSignalFreshMs) &&
        (dashSleepUiLockRequest == 2 || dashSleepUiLockRequest == 3))
        return true;
    if (dashSleepVcsecKnown &&
        dashSleepSignalFresh(dashSleepVcsecSeenMs, kDashSleepDriveSignalFreshMs) &&
        (dashSleepVcsecSimpleLockStatus == 1 ||
         dashSleepVcsecStatusUnlocked(dashSleepVcsecVehicleLockStatus)))
        return true;
    return false;
}

static bool dashSleepParkStateFallbackReady()
{
    if (millis() < kDashSleepLockFallbackMs)
        return false;
    if (dashSleepRecentDriveEvidence())
        return false;

