hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
static void handleConfig()
{
    bool hwChanged = false;
    if (server.hasArg("hw"))
    {
        uint8_t v = server.arg("hw").toInt();
        if (v <= 2 && v != hwMode)
        {
            hwMode = v;
            hwChanged = true;
            dashLog("[CFG] HW=" + String(v == 0 ? "LEGACY" : v == 1 ? "HW3"
                                                                    : "HW4"));
        }
    }
    bool requestedFsdSwitch = canActive;
    bool hasFsdSwitchArg = false;
    if (server.hasArg("can"))
    {
        requestedFsdSwitch = server.arg("can") == "1";
        hasFsdSwitchArg = true;
    }
    if (server.hasArg("force"))
    {
        requestedFsdSwitch = server.arg("force") == "1";
        hasFsdSwitchArg = true;
    }
    if (hasFsdSwitchArg && ((requestedFsdSwitch != canActive) || (requestedFsdSwitch != forceActivate)))
    {
        canActive = requestedFsdSwitch;
        forceActivate = requestedFsdSwitch;
        dashLog("[CFG] FSD master switch " + String(requestedFsdSwitch ? "ON" : "OFF"));
    }
    bool profileAutoRequested = server.hasArg("spa") && server.arg("spa") == "1";
    if (server.hasArg("sp"))
    {
        uint8_t v = dashClampSpeedProfileForHw(hwMode, server.arg("sp").toInt());
        if (!profileAutoRequested && (v != dashManualSpeedProfile || dashSpeedProfileAuto))
            dashLog("[CFG] Speed profile manual " + String(v));
        dashManualSpeedProfile = v;
        if (!profileAutoRequested)
            dashSpeedProfileAuto = false;
    }
    if (server.hasArg("spa"))
    {
        bool v = server.arg("spa") == "1";
        if (v != dashSpeedProfileAuto)
            dashLog("[CFG] Speed profile " + String(v ? "AUTO" : "MANUAL"));
        dashSpeedProfileAuto = v;
    }
    if (server.hasArg("autoSleep"))
    {
        bool v = server.arg("autoSleep") == "1";
        if (v != dashAutoSleepEnabled)
        {
            dashAutoSleepEnabled = v;
            dashSleepCandidateSinceMs = 0;
            dashLog("[CFG] Auto sleep after Park+Lock " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("canprio"))
    {
        bool v = server.arg("canprio") == "1";
        if (v != dashCanPriorityMode)
        {
            dashCanPriorityMode = v;
            dashLog("[CFG] CAN Priority Mode " + String(v ? "ON" : "OFF"));
            dashApplyCanFilterPolicy();
        }
    }
    if (server.hasArg("hw3OffsetSlew"))
    {
        bool v = server.arg("hw3OffsetSlew") == "1";
        if (v != hw3OffsetSlew)
        {
            hw3OffsetSlew = v;
            dashLog("[CFG] HW3 offset slew " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("hw3SlewRate"))
    {
        uint8_t v = dashClampHw3SlewRate(server.arg("hw3SlewRate").toInt());
        if (v != hw3SlewRate)
        {
            hw3SlewRate = v;
            dashLog("[CFG] HW3 slew rate " + String(hw3SlewRate) + "%/s");
        }
    }
    // ─── HW3 custom speed-limit boost ────────────────────────────────────────
    if (server.hasArg("hw3CustomSpeed"))
    {
        bool v = server.arg("hw3CustomSpeed") == "1";
        if (v != hw3CustomSpeed)
        {
            hw3CustomSpeed = v;
            dashLog("[CFG] HW3 custom speed " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("hw3HighSpeedEnable"))
    {
        bool v = server.arg("hw3HighSpeedEnable") == "1";
        if (v != hw3HighSpeedEnable)
        {
            hw3HighSpeedEnable = v;
            dashLog("[CFG] HW3 high-speed " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("hw3WireEncoding"))
    {
        int v = server.arg("hw3WireEncoding").toInt();
        uint8_t enc = (v == kHw3WireEncKph5) ? kHw3WireEncKph5 : kHw3WireEncPct4;
        if (enc != hw3WireEncoding)
        {
            hw3WireEncoding = enc;
            dashLog(String("[CFG] HW3 wire enc ") +
                    (enc == kHw3WireEncPct4 ? "PCT4" : "KPH5"));
        }
    }
    {
        char arg[16];
        for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
        {
            snprintf(arg, sizeof(arg), "hw3CustomT%u", (unsigned)i);
            if (server.hasArg(arg))
                hw3CustomTarget[i] = dashClampHw3CustomTargetForBucket(i,
                    server.arg(arg).toInt());
        }
        for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
        {
            snprintf(arg, sizeof(arg), "hw3HighTarget%u", (unsigned)i);
            if (server.hasArg(arg))
                hw3HighSpeedTarget[i] = dashClampHw3HighSpeedTargetForBucket(i,
                    server.arg(arg).toInt());
        }
    }
    // ─── Legacy MPP custom speed-limit override ──────────────────────────────
    if (server.hasArg("legacyMppOverride"))
    {
        bool v = server.arg("legacyMppOverride") == "1";
        if (v != legacyMppOverride)
        {
            legacyMppOverride = v;
            dashLog("[CFG] Legacy MPP override " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("legacyMppCustomEnable"))
    {
        bool v = server.arg("legacyMppCustomEnable") == "1";
        if (v != legacyMppCustomEnable)
        {
            legacyMppCustomEnable = v;
            dashLog("[CFG] Legacy MPP custom " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("legacyMppHighSpeedEnable"))
    {
        bool v = server.arg("legacyMppHighSpeedEnable") == "1";
        if (v != legacyMppHighSpeedEnable)
        {
            legacyMppHighSpeedEnable = v;
            dashLog("[CFG] Legacy MPP high-speed " + String(v ? "ON" : "OFF"));
        }
    }
    {
        char arg[28];
        for (uint8_t i = 0; i < kLegacyMppCustomTargetCount; i++)
        {
            snprintf(arg, sizeof(arg), "legacyMppCustomT%u", (unsigned)i);
            if (server.hasArg(arg))
                legacyMppCustomTarget[i] = dashClampLegacyMppCustomTargetForBucket(i,
                    server.arg(arg).toInt());
        }
        for (uint8_t i = 0; i < kLegacyMppHighSpeedBucketCount; i++)
        {
            snprintf(arg, sizeof(arg), "legacyMppHighTarget%u", (unsigned)i);
            if (server.hasArg(arg))
                legacyMppHighSpeedTarget[i] = dashClampLegacyMppHighSpeedTargetForBucket(i,
                    server.arg(arg).toInt());
        }
    }
    if (hwChanged)
    {
        dashSwapHandler(hwMode);
        dashApplyFilters();
    }
    dashApplyRuntimeState();
    dashSavePrefs();
    server.send(200, "application/json", "{\"ok\":true}");
}

